{
  "backend/main.mo": "Main ICP actor implementing the full backend: Stripe integration, user profiles, subscriptions, usage stats, ban management, punches, chat messages, therapist sessions, and market config, with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that converts old ban records (keyed by `#mediaBan` policy) into the new `BanRecord` shape with reason, timestamp, and permanent fields.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (custom dragon emoji assets, emoji picker in chat, Internet Identity upload gating, etc.) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON dictionary providing one-sentence summaries of every frontend source file, used as a build-planning reference for the project's React/TypeScript frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML shell for the ForeverRaw Gargoyle Dragon app, setting the page title, favicon, Open Graph/Twitter meta tags, Google Fonts (Cinzel, Bebas Neue, Inter), and mounting the React root.",
  "frontend/src/App.tsx": "Root React app wiring TanStack Router with 10 routes, a BanGate component that redirects banned users, a fixed hamburger menu, an overlay SideMenu, and QueryClient/AppProvider/MenuProvider context wrapping.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component for configuring Stripe payment settings and market configuration (price, category, wallet, payout currency), with validation and status display.",
  "frontend/src/components/AlertList.tsx": "Displays detected threat triggers grouped by type (financial, urgency, coercion, suspicious) in an accordion UI with severity badges.",
  "frontend/src/components/ApiKeyModal.tsx": "Modal dialog for entering, validating, saving, or removing a Google Gemini API key, with format validation and show/hide toggle.",
  "frontend/src/components/BanScreen.tsx": "Full-screen ban notice shown to banned users, displaying ban reason, date, and permanence status fetched via the user's Internet Identity principal.",
  "frontend/src/components/BottomNav.tsx": "Empty file with no content.",
  "frontend/src/components/ChatInterface.tsx": "Chat UI component that integrates Firebase for message persistence and Gemini AI for responses, supporting online/offline modes and session-based message loading.",
  "frontend/src/components/ChatListView.tsx": "Empty file with no content.",
  "frontend/src/components/ChatScreen.tsx": "Chat screen component supporting text and media messages sent to a global broadcast principal, with emoji picker, auto-scroll, and media upload/preview functionality.",
  "frontend/src/components/ConsoleScreen.tsx": "Displays a system status console screen showing real-time ICP network connection, identity, and security feature statuses with a terminal-style log output and status grid.",
  "frontend/src/components/ConsultantScreen.tsx": "Renders the DRAGONFLIES Protocol consultant screen, presenting an 11-step emotional resolution framework as an interactive accordion list, locked behind Internet Identity authentication.",
  "frontend/src/components/CustomDomainPanel.tsx": "Provides a UI panel for configuring a custom domain, showing current domain status and copyable canister URL for CNAME DNS setup.",
  "frontend/src/components/DiscoverView.tsx": "Empty file with no content.",
  "frontend/src/components/EmojiPicker.tsx": "A popover emoji picker component that displays a grid of custom ForeverRaw dragon-themed emojis, allowing users to select and insert them.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors and displays a fallback UI with an error message and a reset button.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a 'Built with caffeine.ai' attribution link and copyright notice.",
  "frontend/src/components/Header.tsx": "Empty file with no content.",
  "frontend/src/components/HeroBanner.tsx": "Empty file with no content.",
  "frontend/src/components/HistoryVault.tsx": "Displays a paginated history of past message analyses with risk scores, individual delete and clear-all functionality, and a detail view for selected items.",
  "frontend/src/components/HotRightNow.tsx": "Empty file with no content.",
  "frontend/src/components/IdentityVerification.tsx": "React component that lets authenticated users submit identity verification documents (stored locally via localStorage) and displays their current verification status (none/pending/approved/rejected) with a collapsible UI.",
  "frontend/src/components/MainAnalyzer.tsx": "Empty file with no content.",
  "frontend/src/components/MarketPublishingStatus.tsx": "Displays the app's Caffeine App Market publishing status, including price, wallet, and royalties earned, with a button to trigger publishing via a mutation hook.",
  "frontend/src/components/MediaProtection.tsx": "Wraps media content to prevent theft by blocking right-click, drag, and keyboard shortcuts (Ctrl+S/C, PrintScreen), triggering a backend ban and full-screen overlay if violations are detected.",
  "frontend/src/components/MediaUploadGate.tsx": "Guards media upload actions by requiring Internet Identity authentication and checking for bans, showing a modal prompt to log in or an access-denied message for banned users.",
  "frontend/src/components/MessageBubble.tsx": "Renders a styled chat message bubble with emoji parsing, optional media content, and a formatted timestamp, styled differently for sent vs. received messages.",
  "frontend/src/components/MetricsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/PaymentFailure.tsx": "Displays a payment cancellation/failure page with options to retry (navigate to /upgrade) or return to the home page.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a payment success/processing page that simulates payment verification, updates subscription status to Pro, and navigates the user back to the home route.",
  "frontend/src/components/ProAccessUpgrade.tsx": "Renders a pricing/upgrade page comparing Free and Pro Dragon tiers with feature lists and a call-to-action button to initiate the Pro subscription flow.",
  "frontend/src/components/ProfileView.tsx": "Shows the authenticated user's warrior profile with editable name/email fields, principal ID display with copy support, identity verification, and logout functionality.",
  "frontend/src/components/PunchCard.tsx": "Empty file with no content.",
  "frontend/src/components/ResolutionAudit.tsx": "Displays a resolution audit panel showing USP and PES psychological metrics from chat messages, with full precision gated behind Pro access.",
  "frontend/src/components/RiskMeter.tsx": "Renders a risk assessment card with a color-coded progress bar and severity label (None/Low/Medium/High/Critical) based on a 0–100 risk score.",
  "frontend/src/components/SafeDraftScreen.tsx": "A private local-only text editor that saves drafts to localStorage with no cloud sync, featuring save and clear actions with a dragon-themed UI.",
  "frontend/src/components/ScanScreen.tsx": "A threat scanner screen that accepts pasted text, runs it through the analyzeText analyzer, and displays risk level and findings with a dragon-themed UI.",
  "frontend/src/components/SettingsPanel.tsx": "A tabbed settings panel covering analysis mode, debounce, history management, Internet Identity auth, API key configuration, Pro subscription status, admin dashboard, and custom domain settings.",
  "frontend/src/components/ShareableUrlBanner.tsx": "A small banner component that displays the app's current origin URL and provides a one-click copy-to-clipboard button.",
  "frontend/src/components/SideMenu.tsx": "A slide-in side navigation menu with swipe gesture support, listing app routes and handling Internet Identity login/logout.",
  "frontend/src/components/SocialFeed.tsx": "An empty file with no content or exports.",
  "frontend/src/components/StripeConfigurationGuide.tsx": "A step-by-step guide component that walks admins through retrieving Stripe API keys, configuring them in the admin dashboard, and testing payment processing, with progress tracking.",
  "frontend/src/components/TopNavBar.tsx": "An empty file with no content or exports.",
  "frontend/src/components/UsageAnalyticsPanel.tsx": "React component that displays application usage statistics (total opens, recent events) fetched via `useGetUsageStats`, with loading/error states and a manual refresh button.",
  "frontend/src/components/ZeroCloudSovereigntyCard.tsx": "Static informational card component describing the app's zero-cloud, zero-trust security model across three features: Local Scrubbing, Resolution over Regulation, and The Sentinel Guard.",
  "frontend/src/contexts/AppContext.tsx": "Global React context provider managing persisted app state including settings, analysis history, API keys, subscription status, and daily scan counts, with backend subscription sync.",
  "frontend/src/contexts/MenuContext.tsx": "Lightweight React context providing shared menu open/close state and toggle functionality via `MenuProvider` and `useMenu` hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useChat.ts": "Collection of React Query hooks for chat functionality including fetching conversations, sending text/media messages, marking messages as read, and managing online status via the backend actor.",
  "frontend/src/hooks/useDebounce.ts": "Simple generic debounce hook that delays updating a returned value until the input value has been stable for the specified delay in milliseconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider implementing Internet Computer Internet Identity authentication using `AuthClient`, exposing identity, login/logout functions, and login status to the component tree.",
  "frontend/src/hooks/usePersistedState.ts": "Custom React hook that syncs state to localStorage, initializing from stored JSON and persisting updates with error handling.",
  "frontend/src/hooks/usePunches.ts": "React Query hooks for CRUD operations on 'punches' (posts), including fetching all, trending, and user-specific punches, plus create, like, unlike, and delete mutations.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend interactions covering user profiles, subscriptions, usage stats, admin checks, and products via the ICP actor.",
  "frontend/src/hooks/useTrackAppOpenOnce.ts": "Hook that fires a single app-open tracking mutation per session using sessionStorage to prevent duplicate calls.",
  "frontend/src/index.css": "Global CSS defining a dark mythical theme with custom CSS variables (blood red, ember orange, void), Tailwind layers, custom fonts (Cinzel, Bebas Neue, Inter), and utility classes for textures and shadows.",
  "frontend/src/lib/analyzer.ts": "Client-side text analysis library that detects scam and manipulation patterns (financial fraud, urgency tactics, homoglyph substitutions) using regex rules with severity levels and educational context.",
  "frontend/src/lib/emojis.ts": "Registry of 15 custom dragon/gargoyle-themed emojis with a parser that converts `:emoji-id:` syntax in message text into typed text/emoji segments.",
  "frontend/src/lib/firebase.ts": "Placeholder Firebase integration module that gracefully falls back to offline/local storage mode when Firebase SDK or environment variables are not configured. Provides interfaces and a FirebaseService class for chat message storage and session subscriptions.",
  "frontend/src/lib/geminiService.ts": "Service class for communicating with Google's Gemini API, supporting API key management, message sending, and key format validation. Exports a singleton instance used throughout the app.",
  "frontend/src/lib/metrics.ts": "Utility module that calculates USP (Unconditional Self-Pride) and PES (Primal Energy System) scores by counting positive and negative keyword frequencies in chat message history. Also provides descriptive label helpers for the computed scores.",
  "frontend/src/lib/types.ts": "Defines shared TypeScript types and interfaces used across the application, including AnalysisMode, DetectedTrigger, AnalysisResult, SubscriptionInfo, and AppSettings.",
  "frontend/src/lib/validation.ts": "Exports a single function that validates Internet Computer principal ID strings by checking format, length, and character constraints.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/src/vite-env.d.ts": "TypeScript declaration file that extends Vite's ImportMetaEnv interface with optional Firebase and Gemini API key environment variables.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom brand palette (void, blood-red, ember-orange, stone), custom fonts, shadows, border radii, and keyframe animations for the ForeverRaw design system.",
  "project_state.json": "Tracks the overall project state for the ForeverRaw Gargoyle Dragon app, including architectural notes, feature list, known issues, and image requirements for 15 custom emoji assets."
}