{
  "backend/main.mo": "Main backend actor implementing user profiles, subscriptions, product management, Stripe integration, usage analytics tracking, and app market configuration with access control and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for app market publishing: admin dashboard configuration panel, OISY wallet setup, and publishing status display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, contexts, and utilities for the Gut-Punch/SecureDraft AI scam detection application with Pro Access gating and Stripe integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for backgrounds, foregrounds, borders, and component colors.",
  "frontend/index.html": "HTML entry point with Open Graph and Twitter Card meta tags for social sharing, featuring Gut Punch branding and AI-powered scam detection messaging.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, theme provider, app-open tracking, and routes for main analyzer, payment success, and payment failure pages.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard with tabbed interface for Stripe configuration management and app market settings including price, description, category, OISY wallet principal, and payout currency selection with validation.",
  "frontend/src/components/AlertList.tsx": "Displays detected threat triggers grouped by type (financial, urgency, coercion, suspicious) in an accordion UI with severity badges, icons, and expandable details for each pattern.",
  "frontend/src/components/ApiKeyModal.tsx": "Modal dialog for configuring and validating Google Gemini API keys with real-time format validation, secure storage, and options to save or remove keys for chat functionality.",
  "frontend/src/components/ChatInterface.tsx": "Chat interface component that manages message state, Firebase initialization for persistence, Gemini API integration for AI responses, and handles online/offline modes with session-based message storage.",
  "frontend/src/components/CustomDomainPanel.tsx": "UI panel for configuring custom domains on Internet Computer canisters, displaying current domain status and providing instructions with copyable configuration values for DNS setup.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a fallback UI showing error details and a retry button to reset the error state.",
  "frontend/src/components/Footer.tsx": "Application footer displaying branding, privacy notice about local-only analysis, shareable URL banner, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying the GUT-PUNCH application logo with lock icon and 'Core Secure Enclave' tagline in a branded design.",
  "frontend/src/components/HistoryVault.tsx": "Displays a list of past text analyses with risk scores, timestamps, and triggers. Allows users to view details, delete individual items, or clear all history with confirmation dialogs.",
  "frontend/src/components/MainAnalyzer.tsx": "Main analysis component that accepts text input, calculates risk scores and triggers using debounced analysis, and orchestrates tabs for safe drafting, chat interface, resolution audit, history vault, and settings. Enforces free-tier daily scan limits.",
  "frontend/src/components/MarketPublishingStatus.tsx": "Displays app publishing status on the Caffeine App Market, showing wallet connection, pricing, royalties earned, and a publish button. Fetches market configuration and handles publishing mutations.",
  "frontend/src/components/MetricsPanel.tsx": "Shows USP (emotional pattern) and PES (psychological load) metrics with color-coded progress bars. Displays reduced resolution for free tier users with a Pro upgrade prompt.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation/failure page with retry and back navigation buttons. Displays a destructive alert informing users no charges were made.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success page that verifies payment, activates Pro subscription status, and displays confirmation with Pro features list. Includes a continue button to return to the app.",
  "frontend/src/components/ProAccessUpgrade.tsx": "Displays subscription plan cards (Free, Pro Monthly, Pro Annual) with upgrade functionality using Stripe checkout sessions and Internet Identity authentication. Handles login/logout, payment processing, and shows admin navigation option.",
  "frontend/src/components/ResolutionAudit.tsx": "Shows current USP (Unconditional Self-Pride) and PES (Psychological/Emotional State) metrics with color-coded indicators. Displays rounded values for free users and full resolution for Pro users with upgrade prompt.",
  "frontend/src/components/RiskMeter.tsx": "Displays a risk assessment meter with progress bar and color-coded levels (None, Low, Medium, High, Critical) from 0-100. Shows contextual alerts for elevated risk scores.",
  "frontend/src/components/SettingsPanel.tsx": "Main settings interface with tabs for general settings, API keys, Pro Access, Admin dashboard, usage analytics, and custom domains. Manages analysis mode, debounce settings, history clearing, and Internet Identity authentication.",
  "frontend/src/components/ShareableUrlBanner.tsx": "Simple banner component that displays the current app URL with a copy-to-clipboard button and success feedback.",
  "frontend/src/components/StripeConfigurationGuide.tsx": "Step-by-step guide component for configuring Stripe payment integration, showing three steps: getting API keys, configuring in admin dashboard, and testing. Includes progress tracking and external links.",
  "frontend/src/components/UsageAnalyticsPanel.tsx": "React component that displays usage analytics statistics in a card layout, including total app opens and recent events, with refresh functionality and loading/error states.",
  "frontend/src/contexts/AppContext.tsx": "React context provider managing global app state including analysis settings, history, API keys, subscription info, and daily scan limits with localStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useDebounce.ts": "Custom React hook that debounces a value by delaying its update until after a specified delay period with proper cleanup.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/usePersistedState.ts": "Custom React hook that persists state to localStorage with JSON serialization, providing automatic sync between state and storage.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, admin roles, products, Stripe configuration, checkout sessions, and usage statistics.",
  "frontend/src/hooks/useTrackAppOpenOnce.ts": "Custom hook that tracks app open events once per session using sessionStorage, with silent failure handling to avoid blocking UI.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark navy and neon green color scheme for the application, including theme tokens for backgrounds, borders, charts, and sidebar components. Includes custom utility classes for neon glow effects and monospace fonts.",
  "frontend/src/lib/analyzer.ts": "Text analysis engine that detects scam patterns using regex-based detection for financial fraud, urgency tactics, and other manipulation techniques. Includes homoglyph mapping, severity classification, and educational context for each detected pattern type.",
  "frontend/src/lib/firebase.ts": "Placeholder Firebase integration module that provides graceful offline fallback functionality for chat message storage and STI session management. Currently operates in local-only mode with Map-based storage until Firebase SDK is installed and configured.",
  "frontend/src/lib/geminiService.ts": "Service class for communicating with Google's Gemini API, handling API key management, message sending, and response parsing. Includes API key validation with prefix checking and comprehensive error handling.",
  "frontend/src/lib/metrics.ts": "Calculates USP (Unconditional Self-Pride) and PES (Primal Energy System) scores from chat message history by analyzing positive and negative keyword frequencies. Provides normalized 0-100 scores with descriptive labels for psychological state assessment.",
  "frontend/src/lib/validation.ts": "Utility function to validate Internet Computer principal ID format using regex pattern matching and structural checks. Ensures IDs are properly formatted base32-encoded strings with hyphens.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context. Renders the main App component with necessary providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/src/vite-env.d.ts": "TypeScript declarations for Vite environment variables, defining Firebase configuration keys and Gemini API key.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking Gut-Punch app features, including existing Pro subscription/custom domain features and pending requests for Caffeine App Market publishing with OISY wallet integration."
}