{
  "backend/main.mo": "Motoko canister managing user profiles, product catalog, Stripe configuration, and subscription data with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, dark mode tokens, and base element styles.",
  "frontend/index.html": "Base HTML document loading the React application root and main entry script.",
  "frontend/src/App.tsx": "Top-level React app with router setup, dark theme enforcement, and layout including Header, MainAnalyzer, and Footer.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard UI for configuring Stripe keys with validation, status checks, and update actions.",
  "frontend/src/components/AlertList.tsx": "Displays detected triggers grouped by type using accordions, icons, and severity badges. Helps users inspect suspicious message patterns.",
  "frontend/src/components/ApiKeyModal.tsx": "Modal UI for viewing, validating, saving, or removing the Gemini API key. Provides real‑time validation and feedback through toasts.",
  "frontend/src/components/ChatInterface.tsx": "Main chat UI handling message input, Firebase initialization, local message loading, and Gemini API usage. Manages online state, session data, and shows the API key modal when needed.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches rendering errors and displays a fallback alert with reset functionality.",
  "frontend/src/components/Footer.tsx": "Static footer showing branding and a note about local-only text analysis unless cloud features are enabled.",
  "frontend/src/components/Header.tsx": "Top navigation header with branding and a lock icon representing the secure enclave theme.",
  "frontend/src/components/HistoryVault.tsx": "Shows stored analysis history with timestamps, risk colors, and management actions like delete and clear-all, including haptic feedback.",
  "frontend/src/components/MainAnalyzer.tsx": "Main text analysis component managing input, scan limits, metrics, history, and UI panels. Uses debounced analysis, clipboard actions, and chat message aggregation.",
  "frontend/src/components/MetricsPanel.tsx": "Displays USP and PES metric values with color-coded progress and limited visibility for free users. Shows Pro‑gated features and basic metric alerts.",
  "frontend/src/components/PaymentFailure.tsx": "UI screen for failed or cancelled payments with retry and return buttons. Shows a destructive alert explaining no charges occurred.",
  "frontend/src/components/PaymentSuccess.tsx": "Handles payment verification, activates Pro access, and displays success or processing states. Provides continuation back to the app once complete.",
  "frontend/src/components/ProAccessUpgrade.tsx": "Subscription upgrade screen listing free and Pro plans, authentication, and Stripe checkout initiation. Manages login, logout, and plan selection with feature comparisons.",
  "frontend/src/components/ResolutionAudit.tsx": "Shows conversation‑based USP/PES audit details with Pro‑gated resolution and metric summaries. Displays message history metrics and color‑coded indicators.",
  "frontend/src/components/RiskMeter.tsx": "Displays a risk score with dynamic color, icon, and progress bar, showing risk level and alerts based on thresholds.",
  "frontend/src/components/SettingsPanel.tsx": "Provides application settings UI including analysis mode, history controls, authentication, subscriptions, and admin tools.",
  "frontend/src/components/StripeConfigurationGuide.tsx": "Interactive guide walking admins through multi‑step Stripe setup with progress tracking and completion handling.",
  "frontend/src/contexts/AppContext.tsx": "Holds global app state such as settings, history, API keys, subscription info, and daily scan limits with persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useDebounce.ts": "Provides a debounced value hook that delays updates by a specified timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth, loading persisted identities, handling login/logout, and exposing auth status.",
  "frontend/src/hooks/usePersistedState.ts": "Custom hook that syncs React state to localStorage with safe serialization and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, products, Stripe config, and checkout sessions using an actor-based backend.",
  "frontend/src/index.css": "Sets Tailwind layers and defines theme variables, dark mode styles, fonts, and neon effects.",
  "frontend/src/lib/analyzer.ts": "Implements text analysis using pattern-based scam detection with homoglyph normalization and severity metadata.",
  "frontend/src/lib/firebase.ts": "Provides a placeholder offline-capable Firebase service for messages with config checks and local storage fallback.",
  "frontend/src/lib/geminiService.ts": "Implements a Gemini API client with API key management, validation, and message sending.",
  "frontend/src/lib/metrics.ts": "Calculates USP and PES scores from chat history using keyword frequency analysis.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the hash for routing.",
  "frontend/src/vite-env.d.ts": "Defines Vite environment variable types for Firebase and Gemini config values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores project state, requirements, and feature requests related to rendering the public UI regardless of Stripe configuration."
}