{
  "backend/main.mo": "Main backend actor with user profile management, subscription tracking, usage stats for free tier daily scan limits, market configuration, access control, blob storage, and Stripe integration.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including dark mythical theme, side menu navigation, Gargoyle Dragon home screen, scan limits, consultant/safe draft screens, and Pro upgrade flows.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with side menu navigation, AppContext with subscription/scan limit state, analyzer with sanitization, themed components, and Pro Access feature gating throughout.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for background, foreground, cards, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point with ForeverRaw branding, Gargoyle Dragon meta tags for social sharing, favicon, Google Fonts (Cinzel and Bebas Neue), and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with TanStack Router defining routes for Social Feed, Discover, Scan, Consultant, Safe Draft, Console, Chat, Profile, Admin, Upgrade, and payment success/failure screens with side menu layout.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component for configuring Stripe payment settings (publishable/secret keys, allowed countries) and market configuration (price, description, category, wallet principal, payout currency). Includes validation, status checking, and market publishing status display.",
  "frontend/src/components/AlertList.tsx": "Displays detected threat patterns (financial, urgency, coercion, suspicious) grouped by type in an accordion UI. Shows severity badges and detailed explanations for each detected trigger.",
  "frontend/src/components/ApiKeyModal.tsx": "Modal dialog for configuring and validating Google Gemini API keys. Provides real-time validation, secure key storage, and options to save or remove the API key.",
  "frontend/src/components/BottomNav.tsx": "Empty component file with no content.",
  "frontend/src/components/ChatInterface.tsx": "Chat interface component that manages message sending/receiving with Firebase backend and Gemini AI integration. Handles online/offline modes, session management, and message persistence with API key configuration.",
  "frontend/src/components/ChatListView.tsx": "Placeholder view for chat messages list showing a 'coming soon' alert. Displays empty state with themed styling using dragon/blood color scheme.",
  "frontend/src/components/ChatScreen.tsx": "One-on-one chat screen component with message history, online status, and real-time messaging. Includes quick emoji reactions and uses Internet Identity for authentication.",
  "frontend/src/components/ConsoleScreen.tsx": "System console/diagnostics screen displaying system status, Dragon Guard status, and monitoring information in a terminal-style interface with themed styling.",
  "frontend/src/components/ConsultantScreen.tsx": "Displays a consultant/therapist tools screen with session notes and resolution guidance features, gated behind Pro subscription access with an upgrade prompt for non-Pro users.",
  "frontend/src/components/CustomDomainPanel.tsx": "Provides UI for configuring custom domain setup, showing current domain status (custom vs default canister URL) and displaying canister URL for CNAME configuration with copy-to-clipboard functionality.",
  "frontend/src/components/DiscoverView.tsx": "Renders a discovery feed showing trending punches fetched from the backend, with loading skeletons and empty state handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details and a retry button.",
  "frontend/src/components/Footer.tsx": "App footer displaying branding (ForeverRaw/Gargoyle Dragon), copyright info, and a powered-by link to caffeine.ai with UTM tracking.",
  "frontend/src/components/Header.tsx": "Empty file with no content.",
  "frontend/src/components/HeroBanner.tsx": "Empty file with no content.",
  "frontend/src/components/HistoryVault.tsx": "Manages and displays analysis history with a list view, detail view, delete functionality, and clear-all option, including risk scoring visualization and haptic feedback.",
  "frontend/src/components/HotRightNow.tsx": "Displays a horizontal scrollable carousel of the top 5 trending punches with view and like counts, including loading and empty states.",
  "frontend/src/components/MainAnalyzer.tsx": "Empty file with no content.",
  "frontend/src/components/MarketPublishingStatus.tsx": "Displays the app's marketplace publishing status with wallet info, pricing, royalties earned, and a publish button. Shows loading states and handles publishing to the Caffeine App Market with toast notifications.",
  "frontend/src/components/MetricsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/PaymentFailure.tsx": "Displays a payment cancellation/failure screen with options to retry payment or return to the app. Shows an error alert indicating no charges were made.",
  "frontend/src/components/PaymentSuccess.tsx": "Handles payment verification after successful checkout, updates subscription status to Pro, and displays confirmation with Pro features list. Shows loading state during verification and navigation to continue.",
  "frontend/src/components/ProAccessUpgrade.tsx": "Displays Pro upgrade pricing tiers (monthly/annual) with feature comparisons and handles Stripe checkout session creation. Shows current Pro status if already subscribed and alerts if payment system is unavailable.",
  "frontend/src/components/ProfileView.tsx": "Displays user profile with avatar, name, punch count, and logout functionality. Includes profile editing dialog and lists user's punches with PunchCard components.",
  "frontend/src/components/PunchCard.tsx": "Renders individual punch posts with user avatar, timestamp, like/unlike functionality, and delete option for own punches. Handles authentication checks for interactions and displays user profile information.",
  "frontend/src/components/ResolutionAudit.tsx": "Displays resolution metrics (USP and PES scores) with emotional/psychological indicators, message audit history, and pro/free tier differentiation with rounded scores for free users.",
  "frontend/src/components/RiskMeter.tsx": "Shows a real-time risk assessment meter with color-coded levels (None/Low/Medium/High/Critical), progress bar, and contextual alerts based on suspicious pattern analysis scores.",
  "frontend/src/components/SafeDraftScreen.tsx": "Provides a private drafting space for users to write messages safely before sending, with local storage persistence and no filtering.",
  "frontend/src/components/ScanScreen.tsx": "Allows authenticated users to scan conversations or profiles with daily limits (10 for free, unlimited for pro), incrementing usage stats and displaying scan results.",
  "frontend/src/components/SettingsPanel.tsx": "Comprehensive settings interface with tabs for general settings, authentication (Internet Identity login/logout), API key management, pro access upgrade, admin dashboard, usage analytics, and custom domain configuration.",
  "frontend/src/components/ShareableUrlBanner.tsx": "Displays the app URL with a copy-to-clipboard button for easy sharing, showing success feedback when copied.",
  "frontend/src/components/SideMenu.tsx": "Responsive side navigation menu with hamburger toggle, displaying app navigation items (Chat, Scan, Consultant, Safe Draft, Console, Profile, Upgrade) with authentication-aware routing and Pro feature indicators.",
  "frontend/src/components/SocialFeed.tsx": "Social feed component displaying a hero section with punch creation textarea, a \"Hot Right Now\" section, and a scrollable list of all punches using PunchCard components.",
  "frontend/src/components/StripeConfigurationGuide.tsx": "Step-by-step wizard component guiding users through Stripe API key setup, admin dashboard configuration, and payment testing with progress tracking and completion callbacks.",
  "frontend/src/components/TopNavBar.tsx": "Empty component file with no content.",
  "frontend/src/components/UsageAnalyticsPanel.tsx": "Dashboard card displaying application usage statistics including total app opens and recent events, with refresh functionality and formatted timestamp display.",
  "frontend/src/components/ZeroCloudSovereigntyCard.tsx": "Informational card explaining the app's zero-trust security model, highlighting local PII scrubbing, security-first approach over regulation, and real-time threat detection features.",
  "frontend/src/contexts/AppContext.tsx": "React context provider managing global app state including analysis settings, history, API keys, subscription status, and daily scan limits with persistent storage using custom hooks.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useChat.ts": "Provides React Query hooks for chat functionality including fetching conversations, sending messages, marking messages as read, managing online status, and getting unread message counts.",
  "frontend/src/hooks/useDebounce.ts": "Custom React hook that debounces a value by delaying updates until a specified delay period has passed without changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout, managing identity state, and handling authentication status with support for delegation identity and local storage persistence.",
  "frontend/src/hooks/usePersistedState.ts": "Custom React hook that persists state to localStorage with JSON serialization, providing error handling for storage operations.",
  "frontend/src/hooks/usePunches.ts": "Provides React Query hooks for managing \"punches\" (posts) including CRUD operations, likes/unlikes, trending punches, user-specific punches, and view count tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for user profiles, admin roles, products, Stripe configuration, checkout sessions, usage stats, market config, and app open tracking.",
  "frontend/src/hooks/useTrackAppOpenOnce.ts": "Tracks app open events once per session using sessionStorage to prevent duplicate tracking, with silent error handling to avoid blocking the UI.",
  "frontend/src/index.css": "Tailwind CSS configuration with a dark \"ForeverRaw\" theme featuring blood-red and ember-orange colors, stone/dragon scale textures, and custom glow effects for a medieval/fantasy aesthetic.",
  "frontend/src/lib/analyzer.ts": "Analyzes text for scam patterns using regex-based detection across financial, urgency, authority, and technical categories, with homoglyph normalization and severity scoring. Returns detected triggers with educational context and risk levels.",
  "frontend/src/lib/firebase.ts": "Placeholder Firebase service with graceful offline fallback that stores chat messages locally when Firebase is unavailable. Provides methods for message persistence and session management with validation safeguards.",
  "frontend/src/lib/geminiService.ts": "Service for communicating with Google's Gemini API using user-configured API keys. Handles message sending, API key validation, and error handling with proper response parsing.",
  "frontend/src/lib/metrics.ts": "Calculates USP (Unconditional Self-Pride) and PES (Primal Energy System) scores by analyzing chat history for positive and negative keyword frequencies. Returns normalized 0-100 scores with descriptive labels.",
  "frontend/src/lib/validation.ts": "Validates Internet Computer principal ID format by checking length, character set (alphanumeric and hyphens), and structural requirements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentity providers wrapping the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/src/vite-env.d.ts": "TypeScript declarations for Vite environment variables including Firebase and Gemini API configuration keys.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark mythical theme with OKLCH color system, custom colors (blood-red primary, ember-orange accent), dragon/gothic fonts (Cinzel, Bebas Neue, Inter), custom shadows, and animation keyframes for accordions and glowing effects.",
  "project_state.json": "Project state document for ForeverRaw, a relationship communication app with dark dragon aesthetic, defining free tier (unlimited chat + 10 scans/day) and pro tier (unlimited scans + therapist tools), plus existing features including theme implementation, navigation structure, chat/scan screens, and therapist mode."
}