{
  "backend/main.mo": "Main backend actor implementing user profiles, subscriptions, product management, Stripe integration, usage analytics tracking (app opens, unique users), and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: custom domain configuration UI, Open Graph/Twitter Card meta tags, and shareable URL display with copy-to-clipboard functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including app-open tracking, Stripe integration, scam detection analyzer, Pro Access feature gating, metrics panels, and SecureDraft AI themed UI components.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light/dark theme variables for background, foreground, borders, and component colors using numeric lightness/chroma/hue values.",
  "frontend/index.html": "HTML entry point with Open Graph and Twitter Card meta tags for social media previews, referencing a social preview image and describing the Gut Punch scam detection app.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup, ThemeProvider, app-open tracking hook, and routes for main analyzer, payment success, and payment failure pages.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component for configuring Stripe API keys (publishable and secret) with validation, country restrictions, configuration status display, and error handling for backend integration.",
  "frontend/src/components/AlertList.tsx": "Displays detected threat triggers grouped by type (financial, urgency, coercion, suspicious) in an accordion UI with icons, severity badges, and expandable details for each pattern.",
  "frontend/src/components/ApiKeyModal.tsx": "Modal dialog for configuring and validating Google Gemini API keys with real-time validation, secure storage, and options to save or remove keys for chat functionality.",
  "frontend/src/components/ChatInterface.tsx": "Chat interface component that manages message history, integrates Firebase for persistence and Gemini for AI responses, with offline mode support and API key configuration.",
  "frontend/src/components/CustomDomainPanel.tsx": "Admin panel for configuring custom domains on Internet Computer canisters, displaying current domain status and providing DNS configuration instructions with copy-to-clipboard functionality.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a fallback UI and retry functionality to prevent full app crashes.",
  "frontend/src/components/Footer.tsx": "Application footer displaying branding, privacy notice about local-only analysis, shareable URL banner, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying the GUT-PUNCH logo with lock icon and \"Core Secure Enclave\" tagline in a branded design.",
  "frontend/src/components/HistoryVault.tsx": "Displays a list of past text analyses with risk scores, timestamps, and triggers. Allows users to view details, delete individual items, or clear all history with confirmation dialogs.",
  "frontend/src/components/MainAnalyzer.tsx": "Main component that orchestrates text analysis, displaying risk scores, metrics, chat interface, and alerts. Manages free tier scan limits, debounced input, and tab navigation between different analysis views.",
  "frontend/src/components/MetricsPanel.tsx": "Displays USP (User Safety Profile) and PES (Psychological Emotional State) metrics with color-coded progress bars. Shows basic metrics for free users and full resolution for Pro subscribers.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation/failure page that displays an error message and provides buttons to retry payment or return to the main app.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success page that verifies the transaction, activates Pro Access subscription, and displays confirmation with a list of unlocked features.",
  "frontend/src/components/ProAccessUpgrade.tsx": "Displays pricing plans (Free, Pro Monthly, Pro Annual) with feature comparisons and handles Internet Identity authentication and Stripe checkout session creation for upgrades.",
  "frontend/src/components/ResolutionAudit.tsx": "Displays resolution metrics (USP and PES scores) with message audit history, showing emotional and psychological indicators. Includes pro/free tier differentiation with rounded scores for free users and detailed metrics for pro users.",
  "frontend/src/components/RiskMeter.tsx": "Renders a risk assessment meter with progress bar and color-coded levels (None, Low, Medium, High, Critical) based on a 0-100 score. Includes accessibility attributes and dynamic styling based on risk level.",
  "frontend/src/components/SettingsPanel.tsx": "Main settings interface with tabs for general settings, authentication (Internet Identity), API key management, pro access upgrades, admin dashboard, usage analytics, and custom domains. Manages app configuration, mode selection, debounce settings, and history clearing.",
  "frontend/src/components/ShareableUrlBanner.tsx": "Simple banner component that displays the current app URL with a copy-to-clipboard button. Shows success feedback when URL is copied.",
  "frontend/src/components/StripeConfigurationGuide.tsx": "Step-by-step guide component for configuring Stripe payment integration, with three steps covering API key retrieval, admin dashboard configuration, and testing. Includes progress tracking and completion state management.",
  "frontend/src/components/UsageAnalyticsPanel.tsx": "Displays usage statistics and analytics with refresh functionality, showing app open counts and recent events. Handles loading, error states, and formats timestamps from bigint nanoseconds.",
  "frontend/src/contexts/AppContext.tsx": "Defines the main application context providing global state for settings, analysis history, API keys, subscription info, and daily scan limits. Includes types for analysis modes (paranoid/balanced/vent), detected triggers, and subscription tiers with persistence via localStorage.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity state. Invalidates dependent queries when the actor changes and initializes access control with admin tokens.",
  "frontend/src/hooks/useDebounce.ts": "Custom React hook that debounces a value by delaying state updates until after a specified delay period, with proper cleanup of timeouts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages identity state, login status, and persists authentication across page reloads.",
  "frontend/src/hooks/usePersistedState.ts": "Custom React hook that synchronizes state with localStorage, providing automatic serialization/deserialization with error handling for corrupted data.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including user profiles, admin roles, products, Stripe configuration, checkout sessions, and usage statistics. Handles actor availability and query invalidation.",
  "frontend/src/hooks/useTrackAppOpenOnce.ts": "Ensures app open tracking occurs only once per session using sessionStorage, with silent error handling to avoid blocking the UI.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom cyberpunk-themed design tokens featuring deep navy backgrounds, neon green accents, and glow effects. Defines CSS variables for colors, spacing, and theme consistency.",
  "frontend/src/lib/analyzer.ts": "Analyzes text for scam patterns using regex-based detection across financial, urgency, authority, and other categories, with homoglyph normalization and severity scoring. Returns detected triggers with educational context and risk levels.",
  "frontend/src/lib/firebase.ts": "Placeholder Firebase service that gracefully falls back to offline mode with local storage when Firebase SDK is not installed or configured. Provides chat message persistence and session management interfaces.",
  "frontend/src/lib/geminiService.ts": "Service for communicating with Google's Gemini API using user-configured API keys. Handles message sending, API key validation, and error handling with proper response parsing.",
  "frontend/src/lib/metrics.ts": "Calculates USP (Unconditional Self-Pride) and PES (Primal Energy System) scores by analyzing chat history for positive and negative keyword frequencies. Provides normalized 0-100 scores with descriptive labels.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/src/vite-env.d.ts": "TypeScript declarations for Vite environment variables, defining optional Firebase and Gemini API configuration keys accessible via import.meta.env.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking the Gut Punch app development with three implemented features for custom domain configuration, social media meta tags, and shareable URL display, plus two pending feature requests and requirements for a social media preview image."
}