{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Always render analyzer UI; gate only Stripe upgrade actions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the main analyzer UI always renders; Stripe status failures only affect upgrade area with non-blocking warnings.",
      "acceptanceCriteria": [
        "Opening the app URL in a fresh browser session (no stored auth, no localStorage) renders the main analyzer UI (not a blank page), regardless of Stripe configuration state.",
        "If Stripe status queries error (network/actor error), the app still renders and shows a non-blocking warning in the subscription/upgrade area only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden Stripe status React Query hooks so they never throw during initial render; on errors, return a safe boolean (e.g., false) and expose error state for UI warnings (non-blocking). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProAccessUpgrade.tsx",
          "operation": "modify",
          "description": "Consume Stripe status hook error state to display a non-blocking warning banner/message only within the Pro Access/upgrade area, while keeping the rest of the app unaffected. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render the normal plans UI even when Stripe is unconfigured; disable paid upgrade actions with clear inline messaging.",
      "acceptanceCriteria": [
        "When Stripe is not configured, the Pro Access screen still shows the plans grid and other UI, but paid plan action buttons are disabled and explain why.",
        "When Stripe is configured, upgrade buttons behave as before and initiate checkout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProAccessUpgrade.tsx",
          "operation": "modify",
          "description": "Remove/avoid the full-page Stripe setup guide gating (no early-return replacement UI); always render the plans grid. When Stripe is not configured (or status unknown), disable paid-plan action buttons and show inline messaging such as “Payments are currently unavailable.” Keep Free plan usable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update checkout/session creation hook usage to ensure paid actions only run when Stripe is available; retain existing checkout initiation behavior when configured. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Hide admin setup navigation/actions from non-admin users in the Pro Access/upgrade area.",
      "acceptanceCriteria": [
        "A non-admin user never sees a button/link to navigate to the Admin Dashboard from the Pro Access/upgrade UI.",
        "An admin user can still navigate to the Admin Dashboard from the same area (if that path exists today)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SettingsPanel.tsx",
          "operation": "modify",
          "description": "Only pass/enable the Admin Dashboard navigation affordance for Pro Access when the caller is confirmed admin (using existing admin state). Ensure non-admins cannot see any \"Go to Admin Dashboard\"-style CTA in the subscription tab. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ProAccessUpgrade.tsx",
          "operation": "modify",
          "description": "Guard any rendering of admin-entry UI (e.g., “Go to Admin Dashboard”) behind a confirmed admin check (use existing admin-check hook/state); if admin status is unknown/loading, default to hiding admin-entry affordances. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}