{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Configure App Market Publishing and OISY Wallet Integration",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add 'Publish to Market' section in Admin Dashboard for configuring marketplace listing settings including price, description, and category",
      "acceptanceCriteria": [
        "Admin Dashboard displays a new 'App Market Publishing' tab or section",
        "Form allows setting a price in USD for paid clones (minimum $0 for free)",
        "Form includes a textarea for marketplace description (separate from app description)",
        "Form includes category selection dropdown",
        "Settings are saved to backend and persisted",
        "Only admin users can access this configuration"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Market Publishing' tab to the existing AdminDashboard component. Create a form section that includes: a number input for price in USD (min 0), a textarea for marketplace description, and a select dropdown for category (using MarketCategory enum values from backend.d.ts). Wire the form to call the backend updateMarketConfig method using the useActor hook. Display current market configuration by fetching data from getMarketConfig. Apply admin-only access control following existing patterns in the component. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add two new React Query hooks: useGetMarketConfig to fetch current market configuration using actor.getMarketConfig(), and useUpdateMarketConfig as a mutation hook to update market settings using actor.updateMarketConfig(config). Both hooks should check for actor availability and follow existing patterns in the file. The mutation should invalidate the market config query on success."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create OISY wallet configuration panel in Admin Dashboard for wallet principal ID and payout currency selection",
      "acceptanceCriteria": [
        "New 'Wallet Configuration' section appears in Admin Dashboard",
        "Input field for OISY wallet principal ID with validation",
        "Radio buttons or dropdown for selecting payout currency (USDC, Bitcoin, ICP)",
        "Display current wallet configuration status",
        "Backend stores wallet principal and currency preference",
        "Only admin users can configure wallet settings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a 'Wallet Configuration' section within the AdminDashboard component. Include a text input for OISY wallet principal ID with Internet Computer principal format validation (basic format check for principal string). Add radio buttons or a select dropdown for payout currency options (USDC, Bitcoin, ICP) using the PayoutCurrency enum from backend.d.ts. Display current wallet status by fetching walletPrincipal and payoutCurrency from the MarketConfig. Wire inputs to update the market configuration via the useUpdateMarketConfig hook. Show connection status based on whether walletPrincipal is set. Apply admin-only access control. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/validation.ts",
          "operation": "create",
          "description": "Create a validation utility file with a function validatePrincipalId that performs basic format validation for Internet Computer principal IDs (checking for alphanumeric characters, hyphens, and proper length). Export this function for use in the wallet configuration form."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display current app market publishing status in Admin Dashboard showing publish state, price, wallet status, and royalties earned",
      "acceptanceCriteria": [
        "Dashboard shows publishing status (Published/Unpublished)",
        "If published, display the current clone price",
        "Show wallet connection status (Connected/Not Connected)",
        "Display wallet principal if connected",
        "Show selected payout currency",
        "Display total royalties earned (can be placeholder initially)",
        "Provide a 'Publish Now' or 'Update Listing' button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MarketPublishingStatus.tsx",
          "operation": "create",
          "description": "Create a new component that displays the current market publishing status. Use the useGetMarketConfig hook to fetch market configuration data. Display isPublished status with visual indicator (Published/Unpublished badge). Show priceUSD when published. Display wallet connection status based on walletPrincipal presence (Connected/Not Connected). Show walletPrincipal value if connected. Display payoutCurrency selection. Show totalRoyaltiesEarned from MarketConfig (format as currency). Include a button that triggers the backend publish() method when clicked. Use shadcn/ui components (Card, Badge, Button) for consistent styling. Handle loading and error states. Verify the build-template-react component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Import and render the MarketPublishingStatus component at the top of the Market Publishing tab section to display current status before the configuration forms. Ensure proper layout and spacing with existing dashboard content."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a usePublish mutation hook that calls actor.publish() to publish the app to the market. Include proper error handling and invalidate the market config query on success to refresh the publishing status display."
        }
      ]
    }
  ]
}